#+BLOG: myblog
#+POSTID: 134
#+DATE: [2022-04-13 Wed 16:23]
#+TITLE: Java
#+startup: overview
** 基本使用
*类或者接口追加了泛型之后，如果不设置泛型类型的时候，会自动使用 Object 类型，在编译的时候会报错* 。
#+begin_src java
class ReallyPoint <T>{
    private T x;
    private T y;
    public ReallyPoint(){}
    public ReallyPoint(T x, T y){
        this.setX(x);
        this.setY(y);
    }

    public T getX() {
        return x;
    }

    public void setX(T x) {
        this.x = x;
    }

    public T getY() {
        return y;
    }

    public void setY(T y) {
        this.y = y;
    }

    @Override
    public String toString() {
        return "ReallyPoint{" +
                "x=" + x +
                ", y=" + y +
                '}';
    }
}
public class Basic {
    public static void main(String[] args) {
        System.out.println("使用泛型");
        ReallyPoint<Integer> reallyPoint1 = new ReallyPoint<Integer>(1, 2);
        ReallyPoint<String> reallyPoint2 = new ReallyPoint<String>("北纬20", "东经120");
        System.out.println(reallyPoint1);
        System.out.println(reallyPoint2);
    }
}

#+end_src

#+RESULTS:
: 使用泛型
: ReallyPoint{x=1, y=2}
: ReallyPoint{x=北纬20, y=东经120}
*** 基本概念
1. 方法的多态性
    1. 方法的重载：同一个方法名称可一根据传入的参数的类型过着个数的不同实现不同的功能。
    #+begin_src java
public class Basic {
    public static void main(String[] args) {
        print();
        print("大帅哥");
    }
    public static void print(){
        System.out.println("Hello, IDEA");
    }
    public static void print(String  name){
        System.out.println("Hello, " + name);
    }
}
    #+end_src

    #+RESULTS:
    : Hello, IDEA
    : Hello, 大帅哥
    2. 方法的覆写：根据子类的不同，方法实现的方式不同
2. 对象的多态性：父子实例之间的转换处理
    1. 对象向上转型：父类 父类实例 = 子类实例；自动完成转换(人是动物)
    2. 对象向下转型：子类 子类实例 = （子类）父类实例；强制完成
在实际情况下， 基本上是使用向上转型， *对于对象的向下转型往往都在使用子类的特殊功能* 。
*** 通过 Object 类支持
Object 类可以通过实例化对象获得 Class， ~public final Class<?> getClass()~
#+begin_src java
import java.util.Date;

public class Test {
    public static void main(String[] args) {
        Date date = new Date();
        Class<? extends Date> cls = date.getClass();
        System.out.println(cls);
        System.out.println(cls.getName());
    }
}
#+end_src

#+RESULTS:
: class java.util.Date
: java.util.Date

这个方式有个不是缺点的缺点，如果想要 Class，那么必须实例化对象。
